#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["go-telegram-test"].github_repository.repo: Refreshing state... [id=go-telegram-test]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["go-game-of-life"].github_repository.repo: Refreshing state... [id=go-game-of-life]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repo["apprepo-dash"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"27443cc3f029bf161560645a26c1f32b3487147309c87a275e9e4bd57cf7947c\"" -> "W/\"8a677f46755bd900e30431ec1f25a0f4c83acb050549df2d1e7d5554064a073d\""
        id                     = "apprepo-dash"
        name                   = "apprepo-dash"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["wsl-setup"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"3327a6295e76df28557715f4a3a25264933425751eb19b33c13f2d2e5e28d27b\"" -> "W/\"98b6380049eba0e3b4c739b3740360de11c2ca3ea8de89e926c1bb6471fea4c5\""
        id                     = "wsl-setup"
        name                   = "wsl-setup"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["bara"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"00874ff4d4c77ec1f2bf5b9146143f4f08c87cdbaf302157bf91e97083f31c91\"" -> "W/\"b1376e059649a9f25d3ae06bd317d41d522b2afe3e05554eb21f53e6e89314bd\""
        id                     = "bara"
        name                   = "bara"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["fiddo"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"751b9afc4dca7852dedcdf67186fdb9299f35f63d55ea1ab0f982ff892ded020\"" -> "W/\"30db3842d799da1328746d71623564bf2b5893e9396c74f1eb76658e29d9ab8d\""
        id                     = "fiddo"
        name                   = "fiddo"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["roguna"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"30617f9b4d2c5479af01463b7df80f13efccd9e8578df08ccb02d33253d167c5\"" -> "W/\"0c8484a5508305baf93f97a60e405aad8e9ce3b9b4e568e15d84c6692104458a\""
        id                     = "roguna"
        name                   = "roguna"
        # (27 unchanged attributes hidden)
    }
  # module.github_repo["game-of-life"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"e433e24e9aadae4151bc424b420a0b55d5530f1b9dcf4683949f5a5bfce2487d\"" -> "W/\"1eac40ccd27e10052cf46bc0c2311f454cb80bbc673b8620e40bb5d78c767416\""
        id                     = "game-of-life"
        name                   = "game-of-life"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["summit-formule"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"0c8e9b4dad7db4ebd836e514709def00d6bb2ee80f21dbe7e92de4ebfb2c44c6\"" -> "W/\"3e1c29682206cad3b0b91f447905ff16bce375a5664bbf37127ddc2194f628a8\""
        id                     = "summit-formule"
        name                   = "summit-formule"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go-game-of-life"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"676eb3f4424a06ade05fa492c987f379eacedb35ea49e49752e149b628d28033\"" -> "W/\"49cfa265d5ce8b4c8eaa7dc9e0d0a91744e01903f4bb5a7e2c3918e0453b0d06\""
        id                     = "go-game-of-life"
        name                   = "go-game-of-life"
      + topics                 = []
        # (26 unchanged attributes hidden)
    }
  # module.github_repo["go-cci-trigger"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"22bcf9e8b5b0062382dc2b20da5a8443679266daddec6b18c9e42d9e6381ce56\"" -> "W/\"4fbec053f63ea917dfa501017a480f3eff54ba90d1e5cd8db89a32a235e99d0c\""
        id                     = "go-cci-trigger"
        name                   = "go-cci-trigger"
        # (27 unchanged attributes hidden)
    }
  # module.github_repo["mefbox"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"67e048a582147f7747009da6438e4f0002f321e75dfc09e63b6c60d0378907ca\"" -> "W/\"2a989d07597e89ab6702153fe7277185430879fa1a5b56c6f0269ded860c129a\""
        id                     = "mefbox"
        name                   = "mefbox"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["dpd-test"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"3070b0862d1a740b8ebc98224d705f65ab687246851a7b02b4a466f02e90e22c\"" -> "W/\"fc2e37cf2857aee0cfdf00ce861c509f56cba02f2e50c79e863e6640b77e341a\""
        id                     = "dpd-test"
        name                   = "dpd-test"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go-api-hello-world"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"271e92a05d12fa93f484f687b1d5e6734f6993705286695ad16072c94615e96d\"" -> "W/\"809d9b7a6259e2628cb2e91bf83c954c319b74d692ab3a749beb842f74111471\""
        id                     = "go-api-hello-world"
        name                   = "go-api-hello-world"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["frajer"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"d1a639d078afaf35a83b621f8f3a6e59fa6cb56c697d8a68be8762244ce1fd6c\"" -> "W/\"9d0cd716b5285f737ad4aa2f62557df05b387e6e4654ee0826c7027da3a5aa9d\""
        id                     = "frajer"
        name                   = "frajer"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["devops-workshop"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"426dbc9722c3754c04c7d169bfda8ce005fbe963d49e8a459a290bc2c09ce9d7\"" -> "W/\"bd380590ef632b6b344770ce6770caefbc599158cccddb80e3af4901119d367e\""
        id                     = "devops-workshop"
        name                   = "devops-workshop"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["toulky"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"7d3873524cac0f97e919efb94e3a5cf83f9666ee5d2fe90066ed35f626331319\"" -> "W/\"43a23745854ccf5f0353533631bdaf3d2d6babad3b3027f9d00fd8355167c521\""
        id                     = "toulky"
        name                   = "toulky"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["vccsturm"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"cb22a4aa4661ca730150f6a17f8aec9c46319a4783245f763cda716cdc9ed2ec\"" -> "W/\"f8697e7417d8b4eefe0de0692d557e4ade9d065b1e430bdb17b97573f0a76bd8\""
        id                     = "vccsturm"
        name                   = "vccsturm"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go-telegram-test"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"b4c939182db43d35471ba5864af9e05a69c8bc0a37783fb95ce1e09a2fe36103\"" -> "W/\"d823d49cb063ced041e0c23454a0dcdfca9fff9ea614901012f93ce815a452ba\""
        id                     = "go-telegram-test"
        name                   = "go-telegram-test"
        # (27 unchanged attributes hidden)
    }
  # module.github_repo["summit-pokemon"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"b9a9f89d4461c87820a629d496365e96e7b3f6eed9127742add7a76fce3d6530\"" -> "W/\"e12a5f6837a24b346a112a7093894b5cf4025875e43a730c3e0f98d823a2cc2e\""
        id                     = "summit-pokemon"
        name                   = "summit-pokemon"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go101"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"0f7f283b81eb0619bed16838ea36dcbfe8a2dd9af729e426f50fc5a1019e83ff\"" -> "W/\"d82236c28a43f51a7d8490ffcdf582743ffff7de1565b7ea2ef940646bb21686\""
        id                     = "go101"
        name                   = "go101"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["anna-helmova"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"254e4252ae692e1ebab95db253b0267ae741324e6f1b5af297e96df4c0327ca5\"" -> "W/\"ed2303d7f76726e17bb9c60e736f014efdd9c149a045d9b026f0e40bb7750af9\""
        id                     = "anna-helmova"
        name                   = "anna-helmova"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["vaclav-dvorak"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"20be1cfbc6070bb9f76832165ce828a95a1ee27140f923eeaf7bf5a232e1817b\"" -> "W/\"3429923f599aac9eee09e481b4e0a6429a43af2fa18869e356804faa91a17200\""
        id                     = "vaclav-dvorak"
        name                   = "vaclav-dvorak"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["maze"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"a4e7d2edefcb3b91c56fbe0b16cf5a997eb63f91a49f6b22135ece1868bd3a9a\"" -> "W/\"da7c10afaa77fae1a7ef4e731b007080f163f1d57692937cdea92138bfd72aa5\""
        id                     = "maze"
        name                   = "maze"
        # (25 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["go-names"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Name search exercise with BoubleTee TUI"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-names"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*